app/decorators/lich_trinh_giang_day_decorator.rb

  def sv_co_mat
  	object.lop_mon_hoc.enrollments.count - sv_vang_mat - object.attendances.where("state = 'idle'").count
---
SELECT COUNT(DISTINCT "attendances"."id") FROM "attendances" LEFT OUTER JOIN "sinh_viens" ON "sinh_viens"."id" = "attendances"."sinh_vien_id" WHERE "attendances"."lich_trinh_giang_day_id" = $1 AND (state = 'idle')
SELECT COUNT(DISTINCT "enrollments"."id") FROM "enrollments" LEFT OUTER JOIN "sinh_viens" ON "sinh_viens"."id" = "enrollments"."sinh_vien_id" WHERE "enrollments"."lop_mon_hoc_id" = $1

  def sv_vang_mat
  	object.attendances.where("state = 'absent'").count
---
SELECT COUNT(DISTINCT "attendances"."id") FROM "attendances" LEFT OUTER JOIN "sinh_viens" ON "sinh_viens"."id" = "attendances"."sinh_vien_id" WHERE "attendances"."lich_trinh_giang_day_id" = $1 AND (state = 'absent')