app/decorators/lich_enrollment_decorator.rb

  def initialize(obj,lich)
    @object = obj
    @lich = lich
    @at = @object.attendances.where(lich_trinh_giang_day_id: @lich.id).first
---
SELECT  "attendances".* FROM "attendances" INNER JOIN "sinh_viens" ON "attendances"."sinh_vien_id" = "sinh_viens"."id" WHERE "sinh_viens"."id" = $1 AND "attendances"."lich_trinh_giang_day_id" = $2  ORDER BY sinh_viens.position, encoded_position LIMIT 1