app/decorators/lop_mon_hoc_decorator.rb

SELECT COUNT(DISTINCT "enrollments"."id") FROM "enrollments" LEFT OUTER JOIN "sinh_viens" ON "sinh_viens"."id" = "enrollments"."sinh_vien_id" WHERE "enrollments"."lop_mon_hoc_id" = $1
---
  def si_so
  	object.enrollments.count