app/decorators/user_decorator.rb

	def is_super_admin?
		object.groups.pluck(:name).include?("superadmin") or object.username=='trungth@hpu.edu.vn' or object.username == 'dungth@hpu.edu.vn'
---
SELECT "groups"."name" FROM "groups" INNER JOIN "user_groups" ON "groups"."id" = "user_groups"."group_id" WHERE "user_groups"."user_id" = $1