app/controllers/teacher/attendances_controller.rb

  def index
   	@lich = LichTrinhGiangDay.find(params[:lich_id])
    #authorize @lich, :update?
    #authorize @lich, :update?
    enrollments = @lich.lop_mon_hoc.enrollments
    results = enrollments.map {|en| LichEnrollmentDecorator.new(en,@lich) }.map {|e| LichEnrollmentSerializer.new(e)}
---
SELECT  "lich_trinh_giang_days".* FROM "lich_trinh_giang_days" WHERE "lich_trinh_giang_days"."id" = $1  ORDER BY thoi_gian, phong LIMIT 1
SELECT "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" IN (411)

  def getnoidung
    @lich = LichTrinhGiangDay.find(params[:lich_id])
---
SELECT  "lich_trinh_giang_days".* FROM "lich_trinh_giang_days" WHERE "lich_trinh_giang_days"."id" = $1  ORDER BY thoi_gian, phong LIMIT 1  [["id", 6728]]