app/controllers/teacher/group_submissions_controller.rb

	def index
		@lop = LopMonHoc.find(params[:id])
---
SELECT  "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" = $1 LIMIT 1