app/controllers/teacher/lich_trinh_giang_days_controller.rb

SELECT  "tuans".* FROM "tuans" WHERE (tu_ngay <= '2016-07-12 01:08:08.093157' and den_ngay >= '2016-07-12 01:08:08.093160')  ORDER BY "tuans"."id" ASC LIMIT 1
---
	def home
		@tuans = Tuan.all

SELECT  "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" = $1 LIMIT 1  [["id", 411]]
SELECT "lich_trinh_giang_days".* FROM "lich_trinh_giang_days" WHERE "lich_trinh_giang_days"."lop_mon_hoc_id" = $1 AND "lich_trinh_giang_days"."id" IN (6727, 9607, 6728, 9608, 6729, 9609, 6722, 6730, 6723, 6731, 6724, 6732, 10876, 6725, 6733, 10877, 6726, 6734, 10946, 4185, 9090, 10947, 4186, 9091, 4187, 9092, 4188, 9093, 4189, 9094, 4190, 9095, 11733, 11734, 4191, 9096, 11519)  ORDER BY thoi_gian, phong  [["lop_mon_hoc_id", 411]]
---
	def index
		@lop = LopMonHoc.find(params[:lop_id])
		@lichs = policy_scope(@lop.lich_trinh_giang_days).map { |l| LopLichTrinhGiangDaySerializer.new(l)}

SELECT  "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" = $1 LIMIT 1
SELECT "lich_trinh_giang_days".* FROM "lich_trinh_giang_days" WHERE "lich_trinh_giang_days"."lop_mon_hoc_id" IN (288, 411)  ORDER BY thoi_gian, phong
SELECT "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" IN (411)
---
	def index_bosung
		@lop = LopMonHoc.find(params[:lop_id])
		@lichs = policy_scope(@lop.lich_trinh_giang_days.bosung).map { |l| LopLichTrinhGiangDaySerializer.new(l)}

SELECT  "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" = $1 LIMIT 1  [["id", 411]]
SELECT "giang_viens".* FROM "giang_viens" WHERE "giang_viens"."id" IN (351)
INSERT INTO "lich_trinh_giang_days" ("lop_mon_hoc_id", "giang_vien_id", "state", "thoi_gian", "phong", "so_tiet", "ltype", "status", "created_at", "updated_at", "tuan", "tiet_bat_dau") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT  "giang_viens".* FROM "giang_viens" WHERE "giang_viens"."id" = $1 LIMIT 1  [["id", 351]]
---
	def create_bosung
		@lop = LopMonHoc.find(params[:lop_id])
		hour = LichTrinhGiangDay::TIET2[params[:tiet_bat_dau].to_i][0].to_s
		minute = LichTrinhGiangDay::TIET2[params[:tiet_bat_dau].to_i][1].to_s
		thoi_gian = Time.strptime(hour + ":" + minute + " " +params[:thoi_gian], "%H:%M %d/%m/%Y")
		if giang_vien
			@lich = lop.lich_trinh_giang_days.with_giang_vien(giang_vien.id).bosung.where(thoi_gian: thoi_gian).first
			if @lich.nil?
				@lich = lop.lich_trinh_giang_days.with_giang_vien(giang_vien.id).bosung.create(thoi_gian: thoi_gian,phong: params[:phong], so_tiet: params[:so_tiet].to_i, ltype: params[:ltype])
			end
			@lichs = lop.lich_trinh_giang_days.with_giang_vien(giang_vien.id).bosung.map { |l| LopLichTrinhGiangDaySerializer.new(l)}

SELECT "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" IN (411)
---
	def capnhat
		# update in lich context
		@lich = lop.lich_trinh_giang_days.find(params[:id])
		authorize @lich, :update?
		if @lich
			@lich.update_attributes(phong: params[:phong], so_tiet: params[:so_tiet].to_i, ltype: params[:ltype])
		end
		enrollments = @lich.lop_mon_hoc.enrollments
      	results = enrollments.map {|en| LichEnrollmentDecorator.new(en,@lich) }.map {|e| LichEnrollmentSerializer.new(e)}

SELECT  "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" = $1 LIMIT 1
---
	def get_lop
		@lop = LopMonHoc.find(params[:lop_id])