app/controllers/teacher/lop_mon_hocs_controller.rb

SELECT  "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" = $1 LIMIT 1  [["id", 411]]
---
	def show
		@lop = LopMonHoc.find(params[:id])