app/controllers/teacher/submissions_controller.rb

SELECT  "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" = $1 LIMIT 1
---
	def index2
		@lop = LopMonHoc.find(params[:id])