app/controllers/application_controller.rb

  def select_shard(&block)
    if params[:tenant_id].present?
      tenant = Tenant.find(params[:tenant_id]) || Tenant.last
      if tenant
        Octopus.using(tenant.database, &block)
      else
        yield
      end
    else
      tenant = Tenant.last
---
SELECT  "tenants".* FROM "tenants"  ORDER BY "tenants"."id" DESC LIMIT 1

  def current_tenant
    if params[:tenant_id].present?
      tenant = Tenant.find(params[:tenant_id])
    else
      Tenant.last
---
SELECT  "tenants".* FROM "tenants"  ORDER BY "tenants"."id" DESC LIMIT 1