app/controllers/dashboard_controller.rb

  def lich
    @lich = LichTrinhGiangDay.find(params[:id])
---
SELECT  "lich_trinh_giang_days".* FROM "lich_trinh_giang_days" WHERE "lich_trinh_giang_days"."id" = $1  ORDER BY thoi_gian, phong LIMIT 1  [["id", 6728]]