app/models/assignment_group.rb

SELECT COUNT(*) FROM "assignments" WHERE "assignments"."assignment_group_id" = $1
---
  def can_destroy?
  	return true if assignments.count == 0