app/models/user.rb

  def get_lops
    if self.imageable.is_a?(SinhVien)
      return self.imageable.enrollments.map {|en| en.lop_mon_hoc if en.lop_mon_hoc and !en.lop_mon_hoc.removed? }.select {|l| !l.nil? }.uniq
    else
     # self.assistants.map {|as| as.lop_mon_hoc if as.lop_mon_hoc and !as.lop_mon_hoc.removed? }.select {|l| !l.nil? }.uniq
    get_lops = Assistant.includes(:lop_mon_hoc).where(:giang_vien_id => self.imageable_id).map {|as| as.lop_mon_hoc if as.lop_mon_hoc and !as.lop_mon_hoc.removed? }.select {|l| !l.nil? }.uniq
---
SELECT "assistants".* FROM "assistants" WHERE "assistants"."giang_vien_id" = $1
SELECT "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" IN (288, 411)

  def get_lichs
    #get_lops.inject([]) {|res, elem| res + elem.lich_trinh_giang_days}.sort_by {|l| [l.thoi_gian, l.phong]}
    if self.imageable.is_a?(SinhVien)
      get_lops.inject([]) {|res, elem| res + elem.lich_trinh_giang_days}.sort_by {|l| [l.thoi_gian, l.phong]}
    else
      #ids = self.assistants.map(&:giang_vien_id)
      ids = Assistant.where(:giang_vien_id => self.imageable_id).map{|as| as.lop_mon_hoc_id}
      get_lichs = LichTrinhGiangDay.includes(:giang_vien).includes(:vi_pham).includes(:lop_mon_hoc).where(lop_mon_hoc_id: ids).sort_by {|l| [l.thoi_gian, l.phong]}
---
SELECT "assistants".* FROM "assistants" WHERE "assistants"."giang_vien_id" = $1
SELECT "giang_viens".* FROM "giang_viens" WHERE "giang_viens"."id" IN (351, 508)
SELECT "lich_trinh_giang_days".* FROM "lich_trinh_giang_days" WHERE "lich_trinh_giang_days"."lop_mon_hoc_id" IN (288, 411)  ORDER BY thoi_gian, phong
SELECT "lop_mon_hocs".* FROM "lop_mon_hocs" WHERE "lop_mon_hocs"."id" IN (411, 288)